---
kind: property
id: P:Autodesk.Revit.DB.PolymeshFacet.IsValidObject
source: html/88e34cf9-778b-cdc1-15dd-d574bfc7c005.htm
---
# Autodesk.Revit.DB.PolymeshFacet.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
This property is always True for a polymesh facet.